#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

github_team.repositorymanager_teams_collaborators_team_BCA4AB9D: Refreshing state... [id=4009231]
github_team_membership.repositorymanager_teams_collaborators_membershipcollaborators_D63F5027: Refreshing state... [id=4009231:skorfmann]
github_repository.repositorymanager_repositories_website_repository_40CA684E: Refreshing state... [id=website]
github_repository.repositorymanager_repositories_base_repository_DC292971: Refreshing state... [id=base]
github_repository.repositorymanager_repositories_repositorymanager_repository_47ED2DF3: Refreshing state... [id=repository-manager]
github_team_repository.repositorymanager_repositories_website_teamgithubteamrepositorymanagerteamscollaboratorsteamBCA4AB9Did_7CADE29C: Refreshing state... [id=4009231:website]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_membership.repositorymanager_members_wulfmann_membership_3212B28E will be created
  + resource "github_membership" "repositorymanager_members_wulfmann_membership_3212B28E" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "wulfmann"
    }

  # github_repository.repositorymanager_repositories_base_repository_DC292971 will be updated in-place
  ~ resource "github_repository" "repositorymanager_repositories_base_repository_DC292971" {
      ~ allow_merge_commit     = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
        archived               = false
        auto_init              = false
        default_branch         = "master"
      ~ delete_branch_on_merge = false -> true
        description            = "Repo for organizing things around cdk.dev"
        etag                   = "W/\"1ab849b1819725763516564e7b2108ca\""
        full_name              = "cdk-dev/base"
        git_clone_url          = "git://github.com/cdk-dev/base.git"
        has_downloads          = false
        has_issues             = true
        has_projects           = false
        has_wiki               = false
        homepage_url           = "https://cdk.dev"
        html_url               = "https://github.com/cdk-dev/base"
        http_clone_url         = "https://github.com/cdk-dev/base.git"
        id                     = "base"
        is_template            = false
        name                   = "base"
        node_id                = "MDEwOlJlcG9zaXRvcnkyODYwNTQ3NTM="
        private                = false
        ssh_clone_url          = "git@github.com:cdk-dev/base.git"
        svn_url                = "https://github.com/cdk-dev/base"
        topics                 = [
            "aws-cdk",
            "cdk",
            "cdk8s",
            "cdktf",
            "constructs",
            "jsii",
            "terraform-cdk",
        ]
    }

  # github_repository.repositorymanager_repositories_repositorymanager_repository_47ED2DF3 will be updated in-place
  ~ resource "github_repository" "repositorymanager_repositories_repositorymanager_repository_47ED2DF3" {
      ~ allow_merge_commit     = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
        archived               = false
        auto_init              = false
        default_branch         = "master"
      ~ delete_branch_on_merge = false -> true
        description            = "Manage repositories within this organization with Terraform CDK"
        etag                   = "W/\"88c297b2a03960acf6a533c1f2b2e9ea\""
        full_name              = "cdk-dev/repository-manager"
        git_clone_url          = "git://github.com/cdk-dev/repository-manager.git"
        has_downloads          = false
        has_issues             = true
        has_projects           = false
        has_wiki               = false
        homepage_url           = "https://cdk.dev"
        html_url               = "https://github.com/cdk-dev/repository-manager"
        http_clone_url         = "https://github.com/cdk-dev/repository-manager.git"
        id                     = "repository-manager"
        is_template            = false
        name                   = "repository-manager"
        node_id                = "MDEwOlJlcG9zaXRvcnkyODc5NTQ4ODI="
        private                = false
        ssh_clone_url          = "git@github.com:cdk-dev/repository-manager.git"
        svn_url                = "https://github.com/cdk-dev/repository-manager"
        topics                 = [
            "cdk",
            "cdktf",
            "terraform-cdk",
        ]
    }

  # github_repository.repositorymanager_repositories_website_repository_40CA684E will be updated in-place
  ~ resource "github_repository" "repositorymanager_repositories_website_repository_40CA684E" {
      ~ allow_merge_commit     = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
        archived               = false
        auto_init              = false
        default_branch         = "master"
      ~ delete_branch_on_merge = false -> true
        description            = "Website for cdk.dev"
        etag                   = "W/\"ef72b71b53f7f19e1f43f593208dd869\""
        full_name              = "cdk-dev/website"
        git_clone_url          = "git://github.com/cdk-dev/website.git"
        has_downloads          = false
        has_issues             = true
        has_projects           = false
        has_wiki               = false
        homepage_url           = "https://cdk.dev"
        html_url               = "https://github.com/cdk-dev/website"
        http_clone_url         = "https://github.com/cdk-dev/website.git"
        id                     = "website"
        is_template            = false
        name                   = "website"
        node_id                = "MDEwOlJlcG9zaXRvcnkyODYwNTI5MjA="
        private                = false
        ssh_clone_url          = "git@github.com:cdk-dev/website.git"
        svn_url                = "https://github.com/cdk-dev/website"
        topics                 = [
            "aws-cdk",
            "cdk",
            "cdk8s",
            "cdktf",
            "constructs",
            "jsii",
            "terraform-cdk",
        ]
    }

  # github_team.repositorymanager_teams_tools_team_75DFBC41 will be created
  + resource "github_team" "repositorymanager_teams_tools_team_75DFBC41" {
      + description = "tools to cdk.dev"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "tools"
      + node_id     = (known after apply)
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # github_team_membership.repositorymanager_teams_collaborators_membershipcollaborators_D63F5027 will be destroyed
  - resource "github_team_membership" "repositorymanager_teams_collaborators_membershipcollaborators_D63F5027" {
      - etag     = "W/\"fba6142debddd6b7fd3b5f62c5eae192\"" -> null
      - id       = "4009231:skorfmann" -> null
      - role     = "maintainer" -> null
      - team_id  = "4009231" -> null
      - username = "skorfmann" -> null
    }

  # github_team_membership.repositorymanager_teams_tools_membershiptools_82EA4D39 will be created
  + resource "github_team_membership" "repositorymanager_teams_tools_membershiptools_82EA4D39" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "wulfmann"
    }

Plan: 3 to add, 3 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @skorfmann, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*